# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Tue Jul 16 15:33:50 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sram_64bit

create_clock -name "clk" -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.15 [get_ports {dout[63]}]
set_load -pin_load 0.15 [get_ports {dout[62]}]
set_load -pin_load 0.15 [get_ports {dout[61]}]
set_load -pin_load 0.15 [get_ports {dout[60]}]
set_load -pin_load 0.15 [get_ports {dout[59]}]
set_load -pin_load 0.15 [get_ports {dout[58]}]
set_load -pin_load 0.15 [get_ports {dout[57]}]
set_load -pin_load 0.15 [get_ports {dout[56]}]
set_load -pin_load 0.15 [get_ports {dout[55]}]
set_load -pin_load 0.15 [get_ports {dout[54]}]
set_load -pin_load 0.15 [get_ports {dout[53]}]
set_load -pin_load 0.15 [get_ports {dout[52]}]
set_load -pin_load 0.15 [get_ports {dout[51]}]
set_load -pin_load 0.15 [get_ports {dout[50]}]
set_load -pin_load 0.15 [get_ports {dout[49]}]
set_load -pin_load 0.15 [get_ports {dout[48]}]
set_load -pin_load 0.15 [get_ports {dout[47]}]
set_load -pin_load 0.15 [get_ports {dout[46]}]
set_load -pin_load 0.15 [get_ports {dout[45]}]
set_load -pin_load 0.15 [get_ports {dout[44]}]
set_load -pin_load 0.15 [get_ports {dout[43]}]
set_load -pin_load 0.15 [get_ports {dout[42]}]
set_load -pin_load 0.15 [get_ports {dout[41]}]
set_load -pin_load 0.15 [get_ports {dout[40]}]
set_load -pin_load 0.15 [get_ports {dout[39]}]
set_load -pin_load 0.15 [get_ports {dout[38]}]
set_load -pin_load 0.15 [get_ports {dout[37]}]
set_load -pin_load 0.15 [get_ports {dout[36]}]
set_load -pin_load 0.15 [get_ports {dout[35]}]
set_load -pin_load 0.15 [get_ports {dout[34]}]
set_load -pin_load 0.15 [get_ports {dout[33]}]
set_load -pin_load 0.15 [get_ports {dout[32]}]
set_load -pin_load 0.15 [get_ports {dout[31]}]
set_load -pin_load 0.15 [get_ports {dout[30]}]
set_load -pin_load 0.15 [get_ports {dout[29]}]
set_load -pin_load 0.15 [get_ports {dout[28]}]
set_load -pin_load 0.15 [get_ports {dout[27]}]
set_load -pin_load 0.15 [get_ports {dout[26]}]
set_load -pin_load 0.15 [get_ports {dout[25]}]
set_load -pin_load 0.15 [get_ports {dout[24]}]
set_load -pin_load 0.15 [get_ports {dout[23]}]
set_load -pin_load 0.15 [get_ports {dout[22]}]
set_load -pin_load 0.15 [get_ports {dout[21]}]
set_load -pin_load 0.15 [get_ports {dout[20]}]
set_load -pin_load 0.15 [get_ports {dout[19]}]
set_load -pin_load 0.15 [get_ports {dout[18]}]
set_load -pin_load 0.15 [get_ports {dout[17]}]
set_load -pin_load 0.15 [get_ports {dout[16]}]
set_load -pin_load 0.15 [get_ports {dout[15]}]
set_load -pin_load 0.15 [get_ports {dout[14]}]
set_load -pin_load 0.15 [get_ports {dout[13]}]
set_load -pin_load 0.15 [get_ports {dout[12]}]
set_load -pin_load 0.15 [get_ports {dout[11]}]
set_load -pin_load 0.15 [get_ports {dout[10]}]
set_load -pin_load 0.15 [get_ports {dout[9]}]
set_load -pin_load 0.15 [get_ports {dout[8]}]
set_load -pin_load 0.15 [get_ports {dout[7]}]
set_load -pin_load 0.15 [get_ports {dout[6]}]
set_load -pin_load 0.15 [get_ports {dout[5]}]
set_load -pin_load 0.15 [get_ports {dout[4]}]
set_load -pin_load 0.15 [get_ports {dout[3]}]
set_load -pin_load 0.15 [get_ports {dout[2]}]
set_load -pin_load 0.15 [get_ports {dout[1]}]
set_load -pin_load 0.15 [get_ports {dout[0]}]
set_clock_gating_check -setup 0.0 
set_max_fanout 20.000 [current_design]
set_input_transition 0.12 [get_ports clk]
set_input_transition 0.12 [get_ports we]
set_input_transition 0.12 [get_ports {addr[5]}]
set_input_transition 0.12 [get_ports {addr[4]}]
set_input_transition 0.12 [get_ports {addr[3]}]
set_input_transition 0.12 [get_ports {addr[2]}]
set_input_transition 0.12 [get_ports {addr[1]}]
set_input_transition 0.12 [get_ports {addr[0]}]
set_input_transition 0.12 [get_ports {din[63]}]
set_input_transition 0.12 [get_ports {din[62]}]
set_input_transition 0.12 [get_ports {din[61]}]
set_input_transition 0.12 [get_ports {din[60]}]
set_input_transition 0.12 [get_ports {din[59]}]
set_input_transition 0.12 [get_ports {din[58]}]
set_input_transition 0.12 [get_ports {din[57]}]
set_input_transition 0.12 [get_ports {din[56]}]
set_input_transition 0.12 [get_ports {din[55]}]
set_input_transition 0.12 [get_ports {din[54]}]
set_input_transition 0.12 [get_ports {din[53]}]
set_input_transition 0.12 [get_ports {din[52]}]
set_input_transition 0.12 [get_ports {din[51]}]
set_input_transition 0.12 [get_ports {din[50]}]
set_input_transition 0.12 [get_ports {din[49]}]
set_input_transition 0.12 [get_ports {din[48]}]
set_input_transition 0.12 [get_ports {din[47]}]
set_input_transition 0.12 [get_ports {din[46]}]
set_input_transition 0.12 [get_ports {din[45]}]
set_input_transition 0.12 [get_ports {din[44]}]
set_input_transition 0.12 [get_ports {din[43]}]
set_input_transition 0.12 [get_ports {din[42]}]
set_input_transition 0.12 [get_ports {din[41]}]
set_input_transition 0.12 [get_ports {din[40]}]
set_input_transition 0.12 [get_ports {din[39]}]
set_input_transition 0.12 [get_ports {din[38]}]
set_input_transition 0.12 [get_ports {din[37]}]
set_input_transition 0.12 [get_ports {din[36]}]
set_input_transition 0.12 [get_ports {din[35]}]
set_input_transition 0.12 [get_ports {din[34]}]
set_input_transition 0.12 [get_ports {din[33]}]
set_input_transition 0.12 [get_ports {din[32]}]
set_input_transition 0.12 [get_ports {din[31]}]
set_input_transition 0.12 [get_ports {din[30]}]
set_input_transition 0.12 [get_ports {din[29]}]
set_input_transition 0.12 [get_ports {din[28]}]
set_input_transition 0.12 [get_ports {din[27]}]
set_input_transition 0.12 [get_ports {din[26]}]
set_input_transition 0.12 [get_ports {din[25]}]
set_input_transition 0.12 [get_ports {din[24]}]
set_input_transition 0.12 [get_ports {din[23]}]
set_input_transition 0.12 [get_ports {din[22]}]
set_input_transition 0.12 [get_ports {din[21]}]
set_input_transition 0.12 [get_ports {din[20]}]
set_input_transition 0.12 [get_ports {din[19]}]
set_input_transition 0.12 [get_ports {din[18]}]
set_input_transition 0.12 [get_ports {din[17]}]
set_input_transition 0.12 [get_ports {din[16]}]
set_input_transition 0.12 [get_ports {din[15]}]
set_input_transition 0.12 [get_ports {din[14]}]
set_input_transition 0.12 [get_ports {din[13]}]
set_input_transition 0.12 [get_ports {din[12]}]
set_input_transition 0.12 [get_ports {din[11]}]
set_input_transition 0.12 [get_ports {din[10]}]
set_input_transition 0.12 [get_ports {din[9]}]
set_input_transition 0.12 [get_ports {din[8]}]
set_input_transition 0.12 [get_ports {din[7]}]
set_input_transition 0.12 [get_ports {din[6]}]
set_input_transition 0.12 [get_ports {din[5]}]
set_input_transition 0.12 [get_ports {din[4]}]
set_input_transition 0.12 [get_ports {din[3]}]
set_input_transition 0.12 [get_ports {din[2]}]
set_input_transition 0.12 [get_ports {din[1]}]
set_input_transition 0.12 [get_ports {din[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
